examples/Query_example-Finnish_PIC.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
    xmlns:urn="urn:fi:tulli:wsdl_root" 
    xmlns:urn1="urn:iso:std:iso:20022:tech:xsd:head.001.001.01" 
    xmlns:urn2="urn:iso:std:iso:20022:tech:xsd:auth.001.001.01" 
    xmlns:urn3="urn:fin.012.001.03">
    <soapenv:Header />
    <soapenv:Body>
        <urn:ApplicationRequest id="applicationRequest">
            <urn:AppHdr>
                <urn1:CharSet>UTF-8</urn1:CharSet>
                <urn1:Fr>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>0245442-8</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:Fr>
                <urn1:To>
                    <urn1:OrgId>
                        <urn1:Id>
                            <urn1:OrgId>
                                <urn1:Othr>
                                    <urn1:Id>0245442-8</urn1:Id>
                                    <urn1:SchmeNm>
                                        <urn1:Cd>Y</urn1:Cd>
                                    </urn1:SchmeNm>
                                </urn1:Othr>
                            </urn1:OrgId>
                        </urn1:Id>
                    </urn1:OrgId>
                </urn1:To>
                <urn1:BizMsgIdr>r6/bz9dlT567HVr5RDi8Zw==</urn1:BizMsgIdr>
                <urn1:MsgDefIdr>auth.001.001.01</urn1:MsgDefIdr>
                <urn1:CreDt>2020-02-03T11:31:11Z</urn1:CreDt>
                <urn1:Sgntr>
                    <Signature xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <SignedInfo>
                            <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                            <SignatureMethod Algorithm="http://www.w3.org/2001/04/xmldsig-more#rsa-sha256"/>
                            <Reference URI="#applicationRequest">
                                <Transforms>
                                    <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                                    <Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
                                </Transforms>
                                <DigestMethod Algorithm="http://www.w3.org/2001/04/xmlenc#sha256"/>
                                <DigestValue>2g0CD4pXHm+5YM9wpf50j+8BEv1rnhqlzSAUezWVjWk=</DigestValue>
                            </Reference>
                        </SignedInfo>
                        <SignatureValue>jHkxSNhbDVhI2sbdDBc7isczJFd7zc86r3RszeqMPn7lgWAGaibzwAS7kyf7LxSQ
N+feEX8ekIN0orVg9JzQ1tRvzf1eabeiMV81rrbxV+VuVIJ2dleMxluHapnGF/pZ
TgIRSZBVEe0pq47qb8hDa4Z55XR7XIeQzEC+opCKhSybTu5iDbQoVeZxuGuDf8hw
20xdjboWfr4h9XFcbMzGbDP/16mQXwdUR7yAatWcE69XHo+xjC8lamHcJLKkxOp8
d/ikNXlTHMa3SaBIQu6Cyn0RMqSwJSL9DvPiHOCM5pjkwUBVOTsqY4zAMXoB+9CE
I43E0Fs5fMypU6psBkKW3HDXrSBqCBSCoIFomp8IyqsZl2RIG4Y126NUW+KlsAXv
Wcm5idaAbMNHuZ7MsdfyJu/yCVM0by3vXLJ6KxSljBoTZ1cos6eGag6LtxXHYNUG
PNSjLYcVMDPOWx34kylWgg3Qeeh+Y0i098UqyjKHoGFuI9jHvFpYe4tDQsn8aeVg
/VRlULMABGh0nmG9WA8XBdMoWPytA3cgRAsUGXIPvIAkWZP2z55zbUnRAhkWSRHT
bkJpicYfBccJU9D1Bf4uvm+71Is9/tv65lj+2l5Mpmur4QMGkrH8jTQsLpsgtIKa
LajylvEgstXV3AtI3WR2DbsHJIRJyjOT5Un8rMSVusk=</SignatureValue>
                        <KeyInfo>
                            <X509Data>
<X509Certificate>MIIHuTCCBaGgAwIBAgIEBgVM/TANBgkqhkiG9w0BAQsFADB0MQswCQYDVQQGEwJG
STEjMCEGA1UEChMaVmFlc3RvcmVraXN0ZXJpa2Vza3VzIFRFU1QxGDAWBgNVBAsT
D1Rlc3RpdmFybWVudGVldDEmMCQGA1UEAxMdVlJLIENBIGZvciBUZXN0IFB1cnBv
c2VzIC0gRzMwHhcNMjAwMzE3MTE0MDAwWhcNMjIwMzE3MjE1OTU5WjByMQswCQYD
VQQGEwJGSTEQMA4GA1UECBMHRmlubGFuZDERMA8GA1UEBxMISGVsc2lua2kxDjAM
BgNVBAoTBVR1bGxpMRMwEQYDVQQFEwpGSTAyNDU0NDI4MRkwFwYDVQQDExBhYy10
ZXN0LnR1bGxpLmZpMIICIjANBgkqhkiG9w0BAQEFAAOCAg8AMIICCgKCAgEA5saz
wL8QwFol7Ujnb5XJ6g56qp5uGPy+8q6SfAdrPE0Q1OPnQhUBGwIUop2fNhiMScu4
GhkiZ6Gm1PMnJgdtPvvtB+vWV8bKRCXmqHIBeDElXT4BbHMA0uS488P2tt0mY+uR
qQSACmx3E1f+24F8OfgMAwoUEEW6o+TNe14Dv0tZbPpaMUludxXO+/5DuKFkm60Y
+4KMjTcQ0EzrpNA1fZQhpx/E7MSjBWx/NvkKuHrzeHoxtk2Jh7X7k/izKAFmPDH1
CcUOjqXooLa5BfRg/OuHDF2LNo7w/eE5FrUzr0jUjLSPKqQo8XXNhHW1XvlqxuS4
JlEiE/ZVnOgEa+pAs6PpI1KpNLmV5z7UZ9MsZarj4KQh+EZ34IF+oOaO7lXbC7Zo
rQz0IpC53iV8K1+JNVfv72NNn2WGd3Mu9+S5WN65rs8AYdhaNHS2SqnWGxrlirKs
gEH8sl45pQj/8gZPw2xltGS5YlH4gHVZCMb7t093KW8zHRVWBa7hNuFkw1eBWkGx
8wiglwBPUW+HKSkIhOjea8wKJAU7OXIoK1TVW5YioIQPjQc5xTUw29/QSmAsRPfn
nyXkHkWnIuJ6YQGb/jnDcwsEcwCUtDz8yNICI074lV6iAHDlUmPduc269n7MPAsP
eonE3TbYg88/nrJSs22XX2hbNREYUhB7E3IpzIUCAwEAAaOCAlMwggJPMB8GA1Ud
IwQYMBaAFFvOhpzHU0PmArn7cWyMbaMg5bH4MB0GA1UdDgQWBBTmqFeQiXz7T6Cj
3LIi02Fmyn8TbTAOBgNVHQ8BAf8EBAMCBLAwgdcGA1UdIASBzzCBzDAIBgYEAI96
AQcwgb8GCSqBdoQFYwoiATCBsTAnBggrBgEFBQcCARYbaHR0cDovL3d3dy5maW5l
aWQuZmkvY3BzOTkvMIGFBggrBgEFBQcCAjB5GndWYXJtZW5uZXBvbGl0aWlra2Eg
b24gc2FhdGF2aWxsYSAtIENlcnRpZmlrYXQgcG9saWN5IGZpbm5zIC0gQ2VydGlm
aWNhdGUgcG9saWN5IGlzIGF2YWlsYWJsZSBodHRwOi8vd3d3LmZpbmVpZC5maS9j
cHM5OTAbBgNVHREEFDASghBhYy10ZXN0LnR1bGxpLmZpMA8GA1UdEwEB/wQFMAMB
AQAwNwYDVR0fBDAwLjAsoCqgKIYmaHR0cDovL3Byb3h5LmZpbmVpZC5maS9jcmwv
dnJrdHAzYy5jcmwwHQYDVR0lBBYwFAYIKwYBBQUHAwIGCCsGAQUFBwMBMG4GCCsG
AQUFBwEBBGIwYDAwBggrBgEFBQcwAoYkaHR0cDovL3Byb3h5LmZpbmVpZC5maS9j
YS92cmt0cDMuY3J0MCwGCCsGAQUFBzABhiBodHRwOi8vb2NzcHRlc3QuZmluZWlk
LmZpL3Zya3RwMzAtBggrBgEFBQcBAwQhMB8wCAYGBACORgEBMBMGBgQAjkYBBjAJ
BgcEAI5GAQYDMA0GCSqGSIb3DQEBCwUAA4ICAQCK0W7YI46zLNPhoLfHwFMh5K2B
mciV3/dCUr6pncKI20VeWDkn12zWWZvVoplADvBPxlj1G7O6ljBtm43XeL32qZ/A
kW1n+I708AyNYAWlslCUVLwlpl6704EjWe1ym1Ybp8iea/dyWatvvLJRp960yaGI
L1/7cALzIIJGQX3H+vhMFno6rS69/jzZmyW+YSyZHNOnqFO2awNJU/2fFFB9S4Lh
GBLnHfvZXMiwLGuOP1FbaOkVj5cakI0SDZavAYFQn5bQK1/45LXO69hdRO8T1tAF
uMiLdox0qdo6BguDXFw8kspttv34oQ+SEQpC3VHb617SnmvovIZzLawk30xh6wP9
hqmhJClXCoLHFSSCePmyU1jbvzeS17U7VTjOaSHh3J+017qov0WLmCZKRxtql9G8
mL2UOSq+bfpMsS0HlrhheA4tiwag8uoQpL8Yb3NrUZQ1ChwNDkzojwApIrs1xR2h
PYLERFt+yxYGNmuyfIdCa1kQ7KFGObGugcqxbwas5j+tl+PKm9fooWbRkfkLG/5k
mcVmY3wmrbNbw7e074FVDXKF7lAJXE5E8cjQhLFgXCsdpIaQETHCJrywHiyHFOjp
+VZzv47X+WJzOsK0q9RzRa+ndxPCgxWeH0y1yK+YJEMCf8kN62uh9QOX1tq9mSUm
grUHxeTf87icp8Wb6w==</X509Certificate>
</X509Data>
                        </KeyInfo>
                    </Signature>
                </urn1:Sgntr>
            </urn:AppHdr>
            <urn:Document>
                <urn2:InfReqOpng>
                    <urn2:InvstgtnId>ABC1234</urn2:InvstgtnId>
                    <urn2:LglMndtBsis>
                        <urn2:Prgrph>testi</urn2:Prgrph>
                    </urn2:LglMndtBsis>
                    <urn2:CnfdtltySts>true</urn2:CnfdtltySts>
                    <urn2:InvstgtnPrd>
                        <urn2:Dt>
                            <urn2:FrDt>2011-01-01</urn2:FrDt>
                            <urn2:ToDt>2020-02-29</urn2:ToDt>
                        </urn2:Dt>
                    </urn2:InvstgtnPrd>
                    <urn2:SchCrit>
                        <urn2:CstmrId>
                            <urn2:Pty>
                                <urn2:Id>
                                    <urn2:PrvtId>
                                        <urn2:Othr>
                                            <urn2:Id>231062-115L</urn2:Id>
                                            <urn2:SchmeNm>
                                                <urn2:Cd>PIC</urn2:Cd>
                                            </urn2:SchmeNm>
                                        </urn2:Othr>
                                    </urn2:PrvtId>
                                </urn2:Id>
                            </urn2:Pty>
                            <urn2:AuthrtyReq>
                                <urn2:Tp>
                                    <urn2:MsgNmId>auth.001.001.01</urn2:MsgNmId>
                                </urn2:Tp>
                                <urn2:InvstgtdRoles>
                                    <urn2:Cd>ALLP</urn2:Cd>
                                </urn2:InvstgtdRoles>
                            </urn2:AuthrtyReq>
                        </urn2:CstmrId>
                    </urn2:SchCrit>
                    <urn2:SplmtryData>
                        <urn2:Envlp>
                            <urn3:Document>
                                <urn3:InfReqFin012>
                                    <urn3:AuthorityInquiry>
                                        <urn3:OfficialId>123456</urn3:OfficialId>
                                        <urn3:OfficialSuperiorId>123456</urn3:OfficialSuperiorId>
                                    </urn3:AuthorityInquiry>
                                </urn3:InfReqFin012>
                            </urn3:Document>
                        </urn2:Envlp>
                    </urn2:SplmtryData>
                </urn2:InfReqOpng>
            </urn:Document>
        </urn:ApplicationRequest>
    </soapenv:Body>
</soapenv:Envelope>